Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: • demonstrate intimate knowledge of the layer model and the protocols used for communication over the Internet
nb: • vise inngående kunnskap om lagmodellen og protokollene som benyttes for kommunikasjon over Internett

source: - The compulsory syllabus (what is stated in the syllabus list) will be reduced to about 500 pages and the students must themselves obtain about 300 pages alternatively the syllabus
nb: Obligatorisk pensum (det som angis i pensumlisten) vil reduseres til ca 500 sider og studentene må selv fremskaffe ca 300 siders alternativt pensum

source: This involves focusing on the individual and collective ability to make decisions (professional competence) and the ability to create support and interaction (relational competence).
nb: Dette med fokus på individuell og kollektiv evne til å ta beslutninger (fagkompetanse) og evne til å skape oppslutning og samhandling (relasjonskompetanse).

source: Build and develop effective performance groups, that are characterised by focus on mission resolution in light of the leader’s intention, strong camaraderie and mutual trust and respect
nb: Bygge og utvikle effektive prestasjonsgrupper, som kjennetegnes ved fokus på oppdragsløsning i lys av sjefens intensjon, sterkt samhold og gjensidig tillit og respekt

source: Trim and stability exercises in connection with loading
nb: Trim og stabilitetsoppgaver i forbindelse med lasting

source: The course Military joint operations 2 will be thematically divided into two parts.
nb: Emne militære fellesoperasjoner 2 vil tematisk være todelt.

source: Today, the UN is failing in its highest priority task (POC).
nb: I dag er oppfatningen at FN mislykkes med sin høyest prioriterte oppgave (POC).

source: The course shall provide the cadet with knowledge in engineering systems with emphasis on auxiliary machinery and systems for marine diesel engines and gas turbines and for the vessel in general.
nb: Emnet skal gi kadetten kunnskap innen maskinerisystemer med vekt på hjelpemaskineri og systemer til marine- dieselmotorer og gassturbiner og til fartøyet generelt.

source: Theme 1 introduces the contextual drivers of operational logistics at political, strategic, operational, and tactical levels.
nb: Tema 1 presenterer de kontekstuelle rammene for operativ logistikk på nivåene politisk – strategisk – operasjonelt – taktisk.

source: In addition, cadets are responsible for choosing a text (minimum 50 pages).
nb: I tillegg har kadettene ansvar for en selvvalgt tekst (minimum 50 sider).

source: Lectures, compulsory exercises, laboratory work and excursion.
nb: Forelesninger, obligatoriske øvinger, laboratoriearbeid og ekskursjon.

source: The study uses different assessment forms, both traditional, such as written and oral examinations, and also assessments in connection with practice arenas.
nb: Studiet benytter ulike vurderingsformer, både tradisjonelle, som skriftlige og muntlige eksamener, og også vurderinger knyttet til praksisarenaer.

source: handle tools and techniques for security monitoring, including monitoring of networks and end systems.
nb: beherske verktøy og teknikker for sikkerhetsmessig overvåking, herunder overvåking av nettverk og endesystemer.

source: The course discusses the relationship between Norwegian air power, the Norwegian Armed Forces, and wider society.
nb: Emnet problematiserer forholdet mellom norsk luftmakt, Forsvaret, og storsamfunnet forøvrig.

source: Familiarity with the physiological possibilities and limitations of man should provide enduring awareness of the ability to lead oneself and others, and help develop good training habits and attitudes towards physical exercise during training and the carrying out of operations.
nb: Kjennskap til menneskets fysiologiske muligheter og begrensninger skal gi varig bevissthet om evnen til å lede seg selv og andre, og bidra til å utvikle gode treningsvaner og holdninger til fysisk trening under opptrening til og utøvelse av operasjoner.

source: Structure of marine electrical installations, production systems, distribution systems, emergency cable system, main and power distributing panels on naval vessels.
nb: Oppbygging av skipselektriske anlegg, produksjonssystemer, fordelingssystemer, nødkabelsystem, hoved- og fordelingstavler på marinefartøy.

source: Any resit as a result of failing the overall grade is given in form of a written examination that covers the whole syllabus, that counts 100% on the final grade.
nb: Eventuell kontinuasjon som følge av stryk på totalkarakteren, gis i form av en eksamen som dekker hele pensum og teller 100% på totalkarakteren.

source: The training will adapt to the activities that take place within the course, including the practice arenas, and are based on excerpts from Gjerstad, Asbjørn (2006).
nb: Undervisningen vil tilpasses de aktivitetene som foregår innenfor emnet, herunder praksisarenaene, og baserer seg på utdrag fra Gjerstad, Asbjørn (2006).

source: Through the use of different teaching and reflection methods before, during and after practice, individual and collective education and development are reinforced.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder underveis og i etterkant av praksis forsterkes individuell og kollektiv læring og utvikling.

source: • explain the strengths and weaknesses of intuitive and analytical decisions
nb: forklare styrker og svakheter ved intuitiv og analytiske beslutninger

source: • Analog and digital modulation and demodulation techniques
nb: • Analoge og digitale modulasjon- og demodulasjonsteknikker

source: Through the use of various learning and reflection methods before, during and after practice, individual and collective learning and development (learning skills) are strengthened.
nb: Ved bruk av forskjellige lærings- og refleksjonsmetoder i forkant, underveis og i etterkant av praksis, forsterkes individuell og kollektiv læring og utvikling (læringskompetanse).

source: explain key developments within air power theory and air force technology and application.
nb: forklare sentrale utviklingstrekk innenfor luftmaktsteori og luftmilitær teknologi og –anvendelse.

source: formulate and solve stochastic problems, both analytically and numerically, and evaluate and explain the achieved results
nb: formulere og løse stokastiske problemer, både analytisk og numerisk, og vurdere og gjøre rede for resultatene

source: The first part of the education shall provide the cadets with a common basic education that is compulsory for all operational personnel within Control and Alert (K&V).
nb: Utdanningens første del skal gi kadettene en felles grunnleggende utdanning som er obligatorisk for alt operativt personell innen Kontroll og varsling (K&V).

source: Internship 1 is an internship period in one's own weapon, and will be a reference for further education and development as an officer.
nb: Praksis 1 er en praksisperiode i eget våpen, og vil være referanse for videre utdanning og utvikling som offiser.

source: Naval, NATO (NRaR og ANEP-43) and civilian regulations on the subject.
nb: Sjømilitære, NATO (NRaR og ANEP-43) og sivile regelverk innen emnet.

source: Dietlefsen: chapter D. Øi: Trigonometry and navigation formulas
nb: kjennskap til hjelpemidler til planlegging av seilasen

source: The purpose of the topic is to provide the cadets with a basic introduction into air force leadership.
nb: Hensikten med temaet er å gi kadettene en grunnleggende innføring i luftmilitær ledelse.

source: Focus on which forces that affect the end result, connection between reliability – operational reliability – cost and performance.
nb: Fokusere på hvilke krefter som påvirker sluttresultatet, sammenhengen mellom pålitelighet – driftsikkerhet – kostnad og ytelse.

source: how can UN peace operations protect civilians from violence?
nb: Hvordan kan FNs fredsoperasjoner beskytte sivile fra vold?

source: explain military and civilian vessel designs regarding stability, damage control, structural strength, a ship's power requirements and dynamic properties, maintenance and supervision
nb: gjøre rede for militære og sivile fartøyskonstruksjoner innen stabilitet, havarikontroll, styrke, skipets effektbehov og dynamiske egenskaper, vedlikehold og tilsyn

source: Explain key principles and tools for managing resources in the armed forces.
nb: Fortelle om prinsippene og hovedverktøyene for virksomhetsstyring i Forsvaret.

source: Officer development: A key part of practice 2.
nb: Offisersutviklingen en sentral del av Praksis 2.

source: The course military joint operations 2 aims to ensure an in-depth level of knowledge and skills for how military joint operations are planned, led and carried out.
nb: Emne militære fellesoperasjoner 2 har til hensikt å sikre et fordypet kunnskaps- og ferdighetsnivå for hvordan militære fellesoperasjoner planlegges, ledes og gjennomføres.

source: In the event of failing digital engineering, resit will be a 4 hour partial examination for this 1/3 of the overall grade.
nb: Hvis stryk i digitalteknikk, vil kontinuasjon være en 4 timers deleksamen for denne 1/3 av totalkarakteren.

source: describe current laws, instructions, other governing documents and national plans.
nb: redegjøre for gjeldende lover, instrukser, andre styringsdokumenter og nasjonale planverk.

source: The semester 3 weekend voyage comes towards the end of the semester, where the aim is to reinforce the training objectives within optical navigation and prepare the cadet for the exam.
nb: Helgeseilasen semester 3 kommer mot slutten av semesteret hvor hensikten er å befeste øvingsmålene innen optisk navigasjon og forberede kadetten mot eksamen.

source: For the Force Protection industry, the course is conducted at the Base Defense Tactical School (BFTS) on Ørland.
nb: For bransjen Force Protection gjennomføres emnet ved Baseforsvarstaktisk skole (BFTS) på Ørland.

source: Chapter 1.1.6 Steering control systems
nb: Kapittel 1.1.6 Styre og kontrollsystemer

source: explain methods and techniques used in military navigation.
nb: forklare metoder og teknikker som anvendes i militær navigasjon.

source: Explain the legal, ethical, and political justifications for weapons that are prohibited, partially banned and controversial.
nb: forklare rettslige og etiske begrunnelser for forbudte, delvis forbudte og omdiskuterte våpen.

source: explain the background and evolution of NATO membership expansion and partnership policies.
nb: forklare bakgrunnen for og utviklingen av NATOs medlemskapsutvidelser og partnerskaps-politikk.

source: provide examples of exhaust gas readings from gas turbines, methods for reduction and treatment, and emission regulations.
nb: gi eksempler på avgassmålinger fra gassturbiner, metoder for reduksjon og behandling, samt utslippsbestemmelsere.

source: The second section of the course (3 weeks) will deal with the implementation phase of a joint operation.
nb: Emnets andre del (3 uker) vil omhandle gjennomføringsfasen av en fellesoperasjon.

source: The first year of study (mid-August-end June) is conducted full-time at NDUC, campus Akershus fortress.
nb: Første studieår (medio august-ultimo juni) gjennomføres på heltid ved Forsvarets høgskole, campus Akershus festning.

source: Factors that impact reliability – operational reliability – cost and performance (maximise system accessibility)
nb: Faktorer som påvirker pålitelighet – driftsikkerhet – kostnad og ytelse (maksimere systemtilgjengelighet)

source: • explain the Fourier transform of periodic and non-periodic functions
nb: • forklare Fouriertransformen av periodiske og ikke-periodiske funksjoner

source: be able to communicate key subject matter such as theories, problems and solutions both in writing and orally.
nb: kunne formidle sentralt fagstoff som teorier, problemstillinger og løsninger både skriftlig og muntlig.

source: read, comprehend, and evaluate military and security related publications.
nb: lese, forstå og kritisk evaluere fagtekster og militære publikasjoner

source: Maintenance and repairs at the operational and support levels.
nb: Vedlikehold og reparasjoner på det operative og støttenivået.

source: discuss prominent dilemmas and challenges related to the leadership and management of, and within, the Norwegian Armed Forces.
nb: drøfte fremtredende dilemmaer og utfordringer knyttet til lederskap og styring av, og i Forsvaret.

source: The development of the officers is ensured through an increased understanding of the role of land power and by identifying the demands imposed on the military profession's practitioners and leaders in combat (leadership identity).
nb: Offisersutviklingen ivaretas gjennom økt forståelse for landmaktens rolle og ved å identifisere de krav som stilles til den militære profesjonsutøver og leder i strid (lederidentitet).

source: Chapter 1.1.5 Compass - magnetic and gyro
nb: Kapittel 1.1.5 Magnetisk og gyrokompass

source: elaborate on key topics, theories, issues, processes, tools and methods within military technology.
nb: beskrive sentrale temaer, teorier, problemstillinger, prosesser, verktøy og metoder innen militærteknologi.

source: use a relevant system of formulas and communicate about mathematics, both orally and in writing
nb: anvende et relevant formelapparat og kommunisere om matematikk, både muntlig og skriftlig

source: Lectures, mandatory assignments, laboratory work and practice arenas
nb: Forelesninger, obligatoriske øvinger, laboratoriearbeid og praksisarenaer.

source: Average grades (final grades in each individual course) are assigned as letters, A (best) - F (fail).
nb: Hovedkarakterer (sluttkarakter i hvert enkelt emne) gis som bokstavkarakterer, A (best) - F (ikke bestått).

source: be able to apply a scientific method to answer a research question.
nb: anvende en vitenskapelig metode for å besvare en problemsstilling.

source: explain the function of the strategic, operational and tactical level in Norway, as well as the strategic and operational level in NATO
nb: beskrive det strategiske, operasjonelle og taktiske ledelsesnivået i Norge, samt det strategiske og operasjonelle ledelsesnivået i NATO

source: Assigned literature (657 pages):
nb: Anvist litteratur (657 sider):

source: Discuss their own leadership philosophy based on relevant theories and experiences.
nb: Drøfte egen lederfilosofi basert på relevante teorier og erfaringer.

source: Design of vessels - up to construction contract.
nb: Prosjektering av fartøyer - fram til byggekontrakt.

source: • Fast Fourier transform (FFT) and inverse FFT
nb: • Fast fourier transform (FFT) og invers FFT

source: explain key aspects of experiential learning.
nb: forklare sentrale forhold rundt erfaringslæring.

source: The course is coordinated with MPN 4, Navigation Systems 1, the ARPA course, the Ryfylke exercise and Watchkeeping and Vessel Control.
nb: Emnet er koordinert med MPN 4, Navigasjonssystemer 1, ARPA kurset, Øvelse Ryfylket og Brovakt og fartøyskontroll.

source: find, plan, coordinate and carry out configuration, installation, operation, defense of networks and information infrastructure, and other engineering projects and experiments, both independently and in teams.
nb: finne, planlegge, koordinere og gjennomføre konfigurasjon, installasjon, drift, forsvar av nettverk og informasjonsinfrastruktur, og andre ingeniørfaglige prosjekter, forsøk og eksperimenter, både selvstendig og i team.

source: A failed assessment unit in “measurement techniques and electronics production” is conducted as an up to 5 hour practical/oral examination.
nb: Ikke bestått vurderingsenhet «måleteknikk og elektronikkproduksjon» gjennomføres som inntil 5 timers praktisk/muntlig eksamen.

source: Understanding the operational environment creates a springboard for making decisions and is prerequisite to contextual awareness and situational leadership.
nb: Forståelse for operasjonsmiljøet bidrar til å etablere beslutningsgrunnlag og skaper forutsetning for situasjonsforståelse og situasjonstilpasset ledelse.

source: One reflection note will deal with the cadet's own officer development in light of industry-specific requirements, while the other will be in the form of an academic essay in English on language and communication in its own industry.
nb: Det ene refleksjonsnotatet skal omhandle kadettens egen offisersutvikling i lys av bransjespesifikke krav, mens det andre skal være i form av et akademsik essay på engelsk om språk og kommunikasjon i egen bransje.

source: The course will provide the necessary knowledge within marine technology to serve, maintain and supervise on vessels in the role of naval engineer and damage control officer in the Navy.
nb: Emnet skal gi nødvendig skipsteknisk kunnskap til å betjene, vedlikeholde og føre tilsyn med fartøyer i rollen som maskin- og havarioffiser i Marinen.

source: MPN must be coordinated with the school vessels Kvarven and Nordnes, Navkomp and the simulator office at Navkomp for the following courses: 5 Fundamentals of Naval Power, 6 Military Problem Solving, Military Watchkeeping and Vessel Control, Military Navigation 1, 2 and 3, Navigation Systems 1 and 2, Operation and Maintenance of Navy Vessels, the ECDIS assistant course, ARPA course, AIS course and the CRM course.
nb: MPN må koordineres med emne 5 sjømaktens grunnlag,6 militær problemløsing, militær brovakt og fartøyskontroll, militær navigasjon 1, 2 og 3, navigasjonssystemer 1 og 2, drift og vedlikehold av Sjøforsvarets fartøy, kursene ECDIS assistent kurs, ARPA kurs AIS kurs og CRM kurs, med skolefartøyene Kvarven og Nordnes,med Navkomp og simulatotkontoret ved Navkomp.

source: Diagram skills and contactor control.
nb: Skjemateknikk og kontaktorstyring.

source: to provide the cadets with an increased self-awareness as a leader and role model.
nb: gi kadettene økt selvbevissthet som leder og rollemodell.

source: • analyse the chosen topic that is the subject for analysis within the thesis.
nb: • analysere det aktuelle tema som er gjort til gjenstand for analyse i oppgaven.

source: At the same time, the section aims to develop their understanding of i) how air power is perceived and experienced from the outside, and ii) intercultural communication and social power structures relevant to leaders in the Armed Forces and the Air Force.
nb: Samtidig settes det søkelys på å utvikle deres forståelse for hvordan i) luftmakt oppfattes og oppleves utenfra, og ii) interkulturell kommunikasjon og sosiale maktstrukturer er relevante for ledere i Forsvaret og Luftforsvaret.

source: Understanding of different types of military Communication and Information (CIS)/cyber operations nationally and internationally
nb: Forståelse av ulike typer militære Communication and Information(CIS)-/cyberoperasjoner nasjonalt og internasjonalt

source: to provide the cadets with the knowledge and understanding of relational skills and the importance of these within the exercise of leadership.
nb: gi kadettene kunnskap og forståelse for relasjonelle ferdigheter og disses betydning i utøvelsen av ledelse.

source: The cadet is further provided with knowledge on the manner of operation and characteristics of marine steam and fuel cell systems.
nb: Videre får kadetten kunnskaper om virkemåte og karakteristikker for marine damp- og brenselcelleanlegg.

source: analyse military strategic options (military strategy), operational concepts and current doctrines within joint military operations.
nb: analysere militærstrategiske valg (militærstrategi), operasjonskonsepter og gjeldende doktriner innenfor militære fellesoperasjoner.

source: Voltage drop, loss and short circuits in marine electrical installations.
nb: Spenningsfall, tap og kortslutning i maritime elektriske anlegg.

source: plan and carry out instructions/briefings for a class.
nb: planlegge og gjennomføre undervisning/briefinger for en klasse.

source: • Partial derivatives, linear approximations, the chain rule, directional derivatives and gradient
nb: • Partielle deriverte, lineære approksimasjoner, kjerneregelen, retningsderiverte og gradient

source: account for key trends in Norwegian military thinking and doctrine development, and discuss what has influenced this thinking and military freedom.
nb: redegjøre for sentrale trender innenfor norsk militær tenkning og doktrineutvikling og drøfte hva som har påvirket denne tenkningen.

source: Fighter pilots are first trained at Sheppard Air Force Base in Texas.
nb: Kampflygere utdannes først ved Sheppard Air Force Base i Texas.

source: General knowledge of loading, transport and unloading with tankers
nb: Generell kjennskap til lasting, transport og lossing med tankskip

source: Blended learning with lectures, compulsory assignment, project assignment, group / plenary discussions that require interdisciplinary integration of knowledge and skills.
nb: Blandet læring med forelesninger, obligatorisk innleveringsoppgave, prosjektoppgave, gruppe-/plenumsdiskusjoner som krever tverrfaglig integrasjonen av kunnskap og ferdigheter.

source: Nevertheless, it remains unexplained exactly how military forces can best be used to protect civilians from armed actors.
nb: Allikevel er det uklart hvordan militære styrker best kan brukes for å beskytte sivile fra væpnede aktører.

source: share key subject matter such as theories, problems and solutions related to navigating with MPN.
nb: formidle sentralt fagstoff som teorier, problemstillinger og løsninger relatert til seilas med MPN.

source: Time-discrete systems theory with z-transformation, difference equations and frequency response analysis.
nb: Tidsdiskret systemteori med z-transformasjon, differensligninger og frekvensresponsanalyse.

source: • calculate and describe electrical field strength and electrical forces
nb: • beregne og beskrive elektrisk feltstyrke og elektriske krefter

source: The course runs 15 weeks.
nb: Antall undervisningsuker er 15.

source: - Analyze the usefulness of military force for the protection of civilians from violent actors.
nb: - Analysere militærmaktens nytteverdi for beskyttelse av sivile fra voldelige aktører.

source: The cadet prepares a navigation plan for the passage and presents it to his/her supervisor the day before departure.
nb: Kadetten utarbeider en navigasjonsplan for seilasen og foreviser denne til veilederen sin dagen før avgang.

source: to provide the cadets with knowledge and skills in giving and receiving feedback.
nb: gi kadettene kunnskap og ferdigheter i å kunne gi og ta i mot tilbakemeldinger.

source: Apply research-based knowledge in the teaching and safeguarding of one’s own personnel, whether before, during or after crises and demanding operations.
nb: anvende forskingsbasert kunnskap for læring og ivaretakelse av eget personell før-, under-, og etter kriser, og belastende operasjoner.

source: Loads on the hull girder in calm seas and for special designs.
nb: Belastninger på skrogbjelken i stille vann og for designsjø.

source: Of great importance is knowledge in fluid-structure-interaction, for example cavitation and pressure signature.
nb: Av stor betydning er kunnskap innen fluid-struktur-interaksjon, eksempelvis kavitasjon og trykksignatur.

source: reflect on one’s own professional practice and adjust this under supervision to exploit any potential in a vessel, crew, weather and surroundings to gain an advantage over the opposition.
nb: reflektere over egen faglig utøvelse og justere denne under veiledning for å utnytte ethvert potensial i fartøy, besetning, vær og omgivelser til å skaffe seg en fordel i forhold til motparten.
